
#小明同学体育课迟到，被老师罚跑5圈，打印小明的跑圈记录
print('-----------第一次被罚-----------------')
for i in range(5):
    print(f'小明同学跑了{i + 1}圈了。')

#小明同学体育课又迟到，被老师罚3个俯卧撑，打印小明的俯卧撑记录
print('-----------第二次被罚-----------------')
for i in range(3):
    print(f'小明同学做了{i + 1}个俯卧撑。')

#小明同学体育课又又迟到，被老师罚跑5圈，然后做3个俯卧撑
print('-----------第三次被罚-----------------')
# for i in range(5):
#     print(f'小明同学跑了{i + 1}圈了。')
# for i in range(3):
#     print(f'小明同学做了{i + 1}个俯卧撑。')

#小明同学体育课又又又迟到，被老师罚跑5圈，每跑1圈做3个俯卧撑
print('-----------第四次被罚-----------------')
# for i in range(5):
#     print(f'小明同学跑了{i + 1}圈了。')
#     for j in range(3):
#         print(f'小明同学做了{j + 1}个俯卧撑。')
i=1
while i<6:
    print(f'小明同学跑了{i}圈了')
    i+=1
    j=1
    while j<4:
        print(f'小明同学做了{j}个俯卧撑。')
        j+=1

#小明同学体育课又又又又迟到，被老师罚跑5圈，跑第1圈做1个俯卧撑
#跑第2圈做2个俯卧撑，俯卧撑个数与第几圈相关
print('-----------第五次被罚-----------------')
# for i in range(5):
#     print(f'小明同学跑了{i + 1}圈了。')
#     for j in range(i+1):
#         print(f'小明同学做了{j + 1}个俯卧撑。')

i=1
while i<6:
    print(f'小明同学跑了{i}圈了')
    i += 1
    for j in range(0,i-1):
        print(f'小明同学做了{j+1}个俯卧撑。')

#小明同学体育课又又又又又迟到,俯卧撑的个数与第几圈的圈数加起来是5
print('-----------第六次被罚-----------------')
# for i in range(5):
#     print(f'小明同学跑了{i + 1}圈了。')
#     for j in range(5-i-1):
#         print(f'小明同学做了{j+1}个俯卧撑。')

#小明同学体育课最后迟到，被老师罚跑5圈，每跑1圈做3个俯卧撑，没做一个俯卧撑说三次下次还敢
print('-----------第七次被罚-----------------')
# for i in range(5):
#     print(f'小明同学跑了{i + 1}圈了。')
#     for j in range(3):
#         print(f'小明同学做了{j + 1}个俯卧撑。')
#         for x in range(3):
#             print('下次还敢')















